IDENTIFICATION DIVISION.
PROGRAM-ID. NAME-GENERATOR.

ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
		FILE-CONTROL.
		SELECT NAME1 ASSIGN TO 'names1.txt'
		ORGANIZATION IS LINE SEQUENTIAL.
		SELECT NAME2 ASSIGN TO 'names2.txt'
		ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
	FILE SECTION.
	FD NAME1.
	01 NAME1-FILE.
		05 NAME1-TEXT PIC A(5).
	FD NAME2.
	01 NAME2-FILE.
		05 NAME2-TEXT PIC A(3).

	WORKING-STORAGE SECTION.
	01 WS-NAME1			PIC A(5).
	01 WS-NAME2			PIC A(3).
	01 WS-NAME1OUT		PIC A(5).
	01 WS-NAME2OUT		PIC A(3).
	01 WS-NAMEOUT		PIC A(8).
	01 WS-EOF			PIC A(1).
	01 WS-RAND			PIC V9(2).
	01 WS-SEED			PIC 9(10).

PROCEDURE DIVISION.
	DISPLAY 'Please provide a random seed. (max 10 digits)'.
	ACCEPT WS-SEED.
	COMPUTE WS-RAND = FUNCTION RANDOM (WS-SEED)
	PERFORM UNTIL NOT WS-NAME1OUT='     '
		OPEN INPUT NAME1
			PERFORM UNTIL WS-EOF='Y'
				READ NAME1 INTO WS-NAME1
					AT END MOVE 'Y' TO WS-EOF
					NOT AT END PERFORM
						COMPUTE WS-RAND = FUNCTION RANDOM
						IF WS-RAND IS GREATER THAN 0.9 THEN
							MOVE WS-NAME1 TO WS-NAME1OUT
						END-IF
					END-PERFORM
				END-READ
			END-PERFORM
		CLOSE NAME1
		MOVE ' ' TO WS-EOF
	END-PERFORM.

	PERFORM UNTIL NOT WS-NAME2OUT='     '
		OPEN INPUT NAME2
			PERFORM UNTIL WS-EOF='Y'
				READ NAME2 INTO WS-NAME2
					AT END MOVE 'Y' TO WS-EOF
					NOT AT END PERFORM
						COMPUTE WS-RAND = FUNCTION RANDOM
						IF WS-RAND IS GREATER THAN 0.9 THEN
							MOVE WS-NAME2 TO WS-NAME2OUT
						END-IF
					END-PERFORM
				END-READ
			END-PERFORM
		CLOSE NAME2
		MOVE ' ' TO WS-EOF
	END-PERFORM.

	STRING WS-NAME1OUT DELIMITED BY SPACE
		WS-NAME2OUT DELIMITED BY SPACE
		INTO WS-NAMEOUT
	END-STRING
	DISPLAY WS-NAMEOUT.

	STOP RUN.
