IDENTIFICATION DIVISION.
PROGRAM-ID. NAME-GENERATOR.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-NAME1		PIC A(5).
	01 WS-NAME2 	PIC A(3).
	01 WS-NAMEOUT	PIC A(8).

PROCEDURE DIVISION.
	DISPLAY WS-NAME1.
STOP RUN.
