IDENTIFICATION DIVISION.
PROGRAM-ID. NAME-GENERATOR.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-NAME1		PIC A(5) VALUE "hello".
	01 WS-NAME2 	PIC A(3) VALUE "hoj".
	01 WS-NAMEOUT	PIC A(8).

PROCEDURE DIVISION.
	STRING WS-NAME1 DELIMITED BY SPACE
		WS-NAME2 DELIMITED BY SPACE
		INTO WS-NAMEOUT
	END-STRING
	DISPLAY WS-NAMEOUT.
STOP RUN.
